Allan_Cannon/belt/app/controllers/ignoreds_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "ignoreds" ("ignorer_id", "ignoree_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ignorer_id", 3], ["ignoree_id", 4], ["created_at", "2017-10-23 20:21:52.501032"], ["updated_at", "2017-10-23 20:21:52.501032"]]
SELECT  1 AS one FROM "ignoreds" WHERE ("ignoreds"."ignorer_id" = 1 AND "ignoreds"."ignoree_id" = 4) LIMIT 1
---
  def create
    ignoree = User.find(params[:ignoree_id])
    ignorer = current_user

    ignor = Ignored.create(ignorer:ignorer,ignoree:ignoree)

    if ignor.errors.any?