Allan_Cannon/belt/app/controllers/invitations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "ignoreds".* FROM "ignoreds" WHERE "ignoreds"."ignorer_id" = 5 AND "ignoreds"."ignoree_id" = 1 LIMIT 1
INSERT INTO "invitations" ("inviter_id", "invitee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["inviter_id", 2], ["invitee_id", 2], ["created_at", "2017-10-23 19:49:58.095406"], ["updated_at", "2017-10-23 19:49:58.095406"]]
SELECT  1 AS one FROM "invitations" WHERE ("invitations"."inviter_id" = 7 AND "invitations"."invitee_id" = 1) LIMIT 1
---
  def create
    invitee = User.find(params[:invitee_id].to_i)
    inviter = current_user

    Ignored.find_by(ignorer:inviter,ignoree:invitee).try(:destroy)

    invite = Invitation.create(inviter:inviter,invitee:invitee)

    if invite.errors.any?