Allan_Cannon/belt/app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @user = User.find(params[:user_id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def professional_profile
    @user = current_user
    @invitations = User.where(id:@user.invited_by).where.not(id:@user.invited).
      where.not(id:@user.ignored_users)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    user = User.find(current_user)
    user.assign_attributes(user_params)

    if user.changed?
      if user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "description" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["description", "Richest man in the world. "], ["updated_at", "2017-10-23 19:27:00.022795"], ["id", 3]]

  def index
    @possible_connections = User.where.not(id:current_user.id).
      where.not(id:current_user.invited_by.where.not(id:current_user.ignored_users)).where.not(id:current_user.invited)
---
SELECT "users".* FROM "users"